import { StepType } from 'lib/src'

export const steps: StepType[] = [
    {
        selector: '[data-guide=One]',
        content:
            'Вы запустили инструкцию которая научит вас создавать такие же. А также покажет вам все основные моменты ее использования',
    },
    {
        selector: '[data-guide=Two]',
        content:
            'Чтобы начать использовать инструкцию вам нужно объявить ваши шаги и передать их в GuideProvider. Также вам нужно передать в PopperContent ваш компонент который будет отображать контент подсказки',
    },
    {
        selector: '[data-guide=Three]',
        content:
            'Вы запустили инструкцию которая научит вас создавать такие же. А также покажет вам все основные моменты ее использования',
    },
]
